package homeWork_06;

/*
@ data 24.05.2024
@ author Alla Novytska

Задача 4
Построчно упростить логическое выражение (соблюдая приоритетность операций):

System.out.println((true | false) | (45 < 70) & !(true) ^ (6 == 5));
Копировать
Пример выполнения:

System.out.println(true || false ^ true && !true);
System.out.println(true || false ^ true && false);
System.out.println(true || true && false);
System.out.println(true || false);
System.out.println(true);
Копировать
Убедиться, что во всех выведенных строчках выводится одинаковое значение типа .boolean
 */

public class HomeWork_06_4 {
    public static void main(String[] args) {

    }
}
