/* package HomeWork04;
/*
@ date 20.05.2024;
@ author Alla Novytska;
Задача 1
Напишите программу на Java, которая преобразует ваше имя,
записанное маленькими буквами, в верхний регистр.

Для каждой буквы имени создайте отдельную переменную типа ,
 инициализированную соответствующей буквой в нижнем регистре.char

Затем преобразуйте каждую букву в верхний регистр,
используя только арифметические операции
(без использования библиотечных функций), и выведите результат.
 */


public class HomeWork04_1_TypChar {


}
/*

    public static void main(String[] args) {
        char a = '\u0061' ;
        char A = '\u0041';
        char a1 = 'A';
        char L1 = 'L';
        char n1 = 'N';
        char o1 = 'O';
        char v1 = 'V';
        char y1 = 'Y';
        char t1 = 'T';
        char s1 = 'S';
        char k1 = 'K';
        char _1 = ' ';
        System.out.println( a1 );
        System.out.println( l1 );
        System.out.println( l1 );
        System.out.println( a1 );
        System.out.println( _1 );

        System.out.println( n1 );
        System.out.println( o1 );
        System.out.println( v1 );
        System.out.println( y1 );
        System.out.println( t1 );
        System.out.println( s1 );
        System.out.println( k1 );
        System.out.println( a1 );


/*

 */
/*
    }
}
*/
