package homeWork_04_Char;
/*
@ data 21.05.2024
@ author Alla Novytska

Задача 1
Напишите программу на Java, которая преобразует ваше имя,
записанное маленькими буквами, в верхний регистр.

Для каждой буквы имени создайте отдельную переменную типа ,
 инициализированную соответствующей буквой в нижнем регистре.char

Затем преобразуйте каждую букву в верхний регистр,
используя только арифметические операции
(без использования библиотечных функций), и выведите результат.
 */

/*
//aA = A
//aL -=21

// aN-=19
// aO-=18
// aV-=11
// aY-=8
// aT-=13
// aS-=14
// AK+=10

 */
public class HomeWork04_2_TypeChar {
    public static void main(String[] args) {

        char a = 'A';
        char a1=(char) +10;
    }
}
