package lesson_04;
/*
Некоторый методы класса String для работы со строками:
length(): возвращает длину строки
substring(): возвращает подстроку, начиная с определенного индекса до конца или до определенного индекса
toLowerCase(): переводит все символы строки в нижний регистр
toUpperCase(): переводит все символы строки в верхний регистр
valueOf(): преобразует объект в строковый вид
charAt(): возвращает символ строки по индексу
regionMatches(): сравнивает подстроки в строках
indexOf(): находит индекс первого вхождения подстроки в строку
lastIndexOf(): находит индекс последнего вхождения подстроки в строку
replace(): заменяет в строке одну подстроку на другую
toCharArray(): можно обратно преобразовать строку в массив символов
isEmpty(): (boolean) является ли строка пустой
equals(): сравнивает строки с учетом регистра
equalsIgnoreCase(): сравнивает строки без учета регистра
сompareTo(): сравнивает две строки
startsWith(): определяет, начинается ли строка с подстроки
endsWith(): определяет, заканчивается ли строка на определенную подстроку
getChars(): возвращает группу символов
trim(): удаляет начальные и конечные пробелы
concat(): объединяет строки
join(): соединяет строки с учетом разделителя

Документация Oracle / Документация Oracle.
 Все методы класса String / Все методы класса String
 https://docs.oracle.com/javase/8/docs/api/java/lang/String.html


https://lms.ait-tr.eu/#/student-cabinet/lessons/group/cohort47E/module/basic_programming/lesson/lesson_04:~:text=%D0%94%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82%D0%B0%D1%86%D0%B8%D1%8F%20Oracle%20/%20%D0%94%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82%D0%B0%D1%86%D0%B8%D1%8F%20Oracle.%20%D0%92%D1%81%D0%B5%20%D0%BC%D0%B5%D1%82%D0%BE%D0%B4%D1%8B%20%D0%BA%D0%BB%D0%B0%D1%81%D1%81%D0%B0%20String%20/%20%D0%92%D1%81%D0%B5%20%D0%BC%D0%B5%D1%82%D0%BE%D0%B4%D1%8B%20%D0%BA%D0%BB%D0%B0%D1%81%D1%81%D0%B0%20String
 */


public class Links {
}
